using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace fireResistance
{
    public class DataFromeSP468
    {
        public static Dictionary<string, int> concreteType = new Dictionary<string, int>()
        {
            {"ТЯЖЕЛЫЙ, НА СИЛИКАТНОМ ЗАПОЛНИТЕЛЕ", 0},
            {"ТЯЖЕЛЫЙ, НА КАРБОНАТНОМ ЗАПОЛНИТЕЛЕ", 1},
            {"КОНСТРУКЦИОННЫЙ КЕРАМЗИТОБЕТОН", 2}
        };
        public static Dictionary<string, double> armatureClass = new Dictionary<string, double>()
        {
            {"A240", 0},
            {"А400", 1},
            {"А500", 2},
            {"А600", 3},
            {"А800", 4},
            {"А1000", 5},
            {"В500", 6},
            {"А500С МАРКА 25Г2С ПО ГОСТ Р 52544-2006", 7},
            {"А600С МАРКИ 18Г2СФ ТЕРМОМЕХАНИЧЕСКИ УПРОЧНЕННАЯ", 8},
            {"А500С МАРКИ Ст3Гпс ТЕРМОМЕХАНИЧЕСКИ УПРОЧНЕННАЯ ПО ГОСТ 34028-2016", 9}
        };

        public static Dictionary<string, int> temperature = new Dictionary<string, int>()
        {
            {"20", 0},
            {"200", 1},
            {"300", 2},
            {"400", 3},
            {"500", 4},
            {"600", 5},
            {"700", 6},
            {"800", 7},
        };

        // Коэффициент гамма_БТ. Данные из таблицы 5.1 СП468
        public static double[,] sheetGammaBT =
        {
            {1.0, 0.98, 0.95, 0.85, 0.80, 0.60, 0.20, 0.10},
            {1.0, 1.0, 0.95, 0.9, 0.85, 0.65, 0.3, 0.15},
            {1.0, 1.0, 1.0, 0.95, 0.85, 0.70, 0.50, 0.25}
        };

        // Коэффициент бета_Б. Данные из таблицы 5.1 СП468
        public static double[,] sheetBetaB =
        {
            {1.0, 0.7, 0.5, 0.4, 0.3, 0.2, 0.1, 0.05},
            {1.0, 0.75, 0.55, 0.45, 0.35, 0.25, 0.15, 0.1},
            {1.0, 0.85, 0.8, 0.7, 0.6, 0.45, 0.3, 0.15}
        };

        // Коэффициент гамма_СТ. Данные из таблицы 5.6 СП468
        public static double[,] sheetGammaSt =
        {
            {1.0, 1.0, 1.0, 0.85, 0.60, 0.37, 0.22, 0.10},
            {1.0, 1.0, 1.0, 0.85, 0.60, 0.37, 0.22, 0.10},
            {1.0, 1.0, 1.0, 0.85, 0.60, 0.37, 0.22, 0.10},
            {1.0, 1.0, 0.96, 0.8, 0.55, 0.3, 0.12, 0.08},
            {1.0, 1.0, 0.96, 0.8, 0.55, 0.3, 0.12, 0.08},
            {1.0, 1.0, 0.96, 0.8, 0.55, 0.3, 0.12, 0.08},
            {1.0, 1.0, 0.9, 0.65, 0.35, 0.15, 0.05, 0.02},
            {1.0, 1.0, 1.0, 0.92, 0.87, 0.76, 0.39, 0.18},
            {1.0, 0.92, 0.84, 0.76, 0.82, 0.69, 0.42, 0.13},
            {1.0, 0.97, 0.94, 0.87, 0.85, 0.72, 0.43, 0.17}
        };

        // Коэффициент бета_СТ. Данные из таблицы 5.6 СП468
        public static double[,] sheetBetaS =
{
            {1.0, 0.92, 0.9, 0.85, 0.80, 0.77, 0.72, 0.65},
            {1.0, 0.92, 0.9, 0.85, 0.80, 0.77, 0.72, 0.65},
            {1.0, 0.92, 0.9, 0.85, 0.80, 0.77, 0.72, 0.65},
            {1.0, 0.9, 0.85, 0.8, 0.76, 0.7, 0.66, 0.61},
            {1.0, 0.9, 0.85, 0.8, 0.76, 0.7, 0.66, 0.61},
            {1.0, 0.9, 0.85, 0.8, 0.76, 0.7, 0.66, 0.61},
            {1.0, 0.94, 0.86, 0.77, 0.64, 0.55, 0.45, 0.35},
            {1.0, 1.0, 1.0, 0.99, 0.94, 0.93, 0.77, 0.6},
            {1.0, 0.99, 0.99, 0.91, 0.91, 0.83, 0.72, 0.65},
            {1.0, 1.0, 1.0, 0.98, 0.93, 0.88, 0.82, 0.67}
        };
    }
}
